src/__tests__/fixtures/charge_create_source.json

{
  "object": "charge",
  "id": "chrg_test_5nk5zb5r9f2tk6ifgh4",
  "location": "/charges/chrg_test_5nk5zb5r9f2tk6ifgh4",
  "amount": 20000,
  "net": 19647,
  "fee": 330,
  "fee_vat": 23,
  "interest": 0,
  "interest_vat": 0,
  "funding_amount": 20000,
  "refunded_amount": 0,
  "authorized": false,
  "capturable": false,
  "capture": true,
  "disputable": false,
  "livemode": false,
  "refundable": false,
  "reversed": false,
  "reversible": false,
  "voided": false,
  "paid": false,
  "expired": false,
  "platform_fee": {
      "fixed": null,
      "amount": null,
      "percentage": null
  },
  "currency": "THB",
  "funding_currency": "THB",
  "ip": null,
  "refunds": {
      "object": "list",
      "data": [],
      "limit": 20,
      "offset": 0,
      "total": 0,
      "location": "/charges/chrg_test_5nk5zb5r9f2tk6ifgh4/refunds",
      "order": "chronological",
      "from": "1970-01-01T00:00:00Z",
      "to": "2021-04-18T18:45:28Z"
  },
  "link": null,
  "description": null,
  "metadata": {},
  "card": null,
  "source": {
      "object": "source",
      "id": "src_test_5nk5zb5en6v9ytzld4u",
      "livemode": false,
      "location": "/sources/src_test_5nk5zb5en6v9ytzld4u",
      "amount": 20000,
      "barcode": null,
      "bank": null,
      "created_at": "2021-04-18T18:45:28Z",
      "currency": "THB",
      "email": null,
      "flow": "offline",
      "installment_term": null,
      "name": null,
      "mobile_number": null,
      "phone_number": null,
      "scannable_code": {
          "object": "barcode",
          "type": "qr",
          "image": {
              "object": "document",
              "livemode": false,
              "id": "docu_test_5nk5zb7maw2v1atytg2",
              "deleted": false,
              "filename": "qrcode_test.svg",
              "location": "/charges/chrg_test_5nk5zb5r9f2tk6ifgh4/documents/docu_test_5nk5zb7maw2v1atytg2",
              "download_uri": "https://api.omise.co/charges/chrg_test_5nk5zb5r9f2tk6ifgh4/documents/docu_test_5nk5zb7maw2v1atytg2/downloads/8E6B024008B37A49",
              "created_at": "2021-04-18T18:45:28Z"
          }
      },
      "references": null,
      "store_id": null,
      "store_name": null,
      "terminal_id": null,
      "type": "promptpay",
      "zero_interest_installments": null,
      "charge_status": "pending",
      "receipt_amount": null,
      "discounts": []
  },
  "schedule": null,
  "customer": null,
  "dispute": null,
  "transaction": null,
  "failure_code": null,
  "failure_message": null,
  "status": "pending",
  "authorize_uri": null,
  "return_uri": null,
  "created_at": "2021-04-18T18:45:28Z",
  "paid_at": null,
  "expires_at": "2021-04-25T18:45:28Z",
  "expired_at": null,
  "reversed_at": null,
  "zero_interest_installments": false,
  "branch": null,
  "terminal": null,
  "device": null
}