src/__tests__/fixtures/charge_events.json

{
  "object": "list",
  "data": [
      {
          "object": "event",
          "id": "evnt_test_5nk0sszxfgnqlca7t5c",
          "livemode": false,
          "location": "/events/evnt_test_5nk0sszxfgnqlca7t5c",
          "webhook_deliveries": [],
          "data": {
              "object": "charge",
              "id": "chrg_test_5nk0ssyef8lsx3lpqv5",
              "location": "/charges/chrg_test_5nk0ssyef8lsx3lpqv5",
              "amount": 10000,
              "net": 9609,
              "fee": 365,
              "fee_vat": 26,
              "interest": 0,
              "interest_vat": 0,
              "funding_amount": 10000,
              "refunded_amount": 0,
              "authorized": true,
              "capturable": false,
              "capture": true,
              "disputable": true,
              "livemode": false,
              "refundable": true,
              "reversed": false,
              "reversible": false,
              "voided": false,
              "paid": true,
              "expired": false,
              "platform_fee": {
                  "fixed": null,
                  "amount": null,
                  "percentage": null
              },
              "currency": "THB",
              "funding_currency": "THB",
              "ip": null,
              "refunds": {
                  "object": "list",
                  "data": [],
                  "limit": 20,
                  "offset": 0,
                  "total": 0,
                  "location": "/charges/chrg_test_5nk0ssyef8lsx3lpqv5/refunds",
                  "order": "chronological",
                  "from": "1970-01-01T07:00:00+07:00",
                  "to": "2021-04-18T16:55:39+07:00"
              },
              "link": null,
              "description": null,
              "metadata": {},
              "card": {
                  "object": "card",
                  "id": "card_test_5m922dndm13zd2reh84",
                  "livemode": false,
                  "location": "/customers/cust_test_5m922s0sv3dxsjzneu1/cards/card_test_5m922dndm13zd2reh84",
                  "deleted": false,
                  "street1": null,
                  "street2": null,
                  "city": "Bangkok",
                  "state": null,
                  "phone_number": null,
                  "postal_code": "10320",
                  "country": "gb",
                  "financing": "credit",
                  "bank": "SAMPLE BANK",
                  "brand": "Visa",
                  "fingerprint": "QBJ1ZXhEZf6sXO7YJ7ESAHzjynCFEE2rmrNlKXAgT1I=",
                  "first_digits": null,
                  "last_digits": "4242",
                  "name": "JOHN DOE",
                  "expiration_month": 12,
                  "expiration_year": 2022,
                  "security_code_check": true,
                  "created_at": "2020-12-19T15:08:58+07:00"
              },
              "source": null,
              "schedule": "schd_test_5nk0ssxsjf0iqdahbyj",
              "customer": "cust_test_5m922s0sv3dxsjzneu1",
              "dispute": null,
              "transaction": "trxn_test_5nk0sszmi4upf3f4j2a",
              "failure_code": null,
              "failure_message": null,
              "status": "successful",
              "authorize_uri": null,
              "return_uri": null,
              "created_at": "2021-04-18T16:55:39+07:00",
              "paid_at": "2021-04-18T16:55:39+07:00",
              "expires_at": "2021-04-25T16:55:39+07:00",
              "expired_at": null,
              "reversed_at": null,
              "zero_interest_installments": false,
              "branch": null,
              "terminal": null,
              "device": null
          },
          "key": "charge.create",
          "created_at": "2021-04-18T09:55:39Z"
      }
  ],
  "limit": 20,
  "offset": 0,
  "total": 1,
  "location": "/charges/chrg_test_5nk0ssyef8lsx3lpqv5/events",
  "order": "chronological",
  "from": "1970-01-01T00:00:00Z",
  "to": "2021-04-18T19:04:01Z"
}