src/__tests__/fixtures/charge_retrieve.json

{
  "object": "charge",
  "id": "chrg_test_5nk0ssyef8lsx3lpqv5",
  "location": "/charges/chrg_test_5nk0ssyef8lsx3lpqv5",
  "amount": 10000,
  "net": 9609,
  "fee": 365,
  "fee_vat": 26,
  "interest": 0,
  "interest_vat": 0,
  "funding_amount": 10000,
  "refunded_amount": 0,
  "authorized": true,
  "capturable": false,
  "capture": true,
  "disputable": false,
  "livemode": false,
  "refundable": false,
  "reversed": false,
  "reversible": false,
  "voided": false,
  "paid": true,
  "expired": false,
  "platform_fee": {
    "fixed": null,
    "amount": null,
    "percentage": null
  },
  "currency": "THB",
  "funding_currency": "THB",
  "ip": null,
  "refunds": {
    "object": "list",
    "data": [

    ],
    "limit": 20,
    "offset": 0,
    "total": 0,
    "location": "/charges/chrg_test_5nk0ssyef8lsx3lpqv5/refunds",
    "order": "chronological",
    "from": "1970-01-01T00:00:00Z",
    "to": "2021-04-18T14:45:18Z"
  },
  "link": null,
  "description": null,
  "metadata": {
  },
  "card": {
    "object": "card",
    "id": "card_test_5m922dndm13zd2reh84",
    "livemode": false,
    "location": "/customers/cust_test_5m922s0sv3dxsjzneu1/cards/card_test_5m922dndm13zd2reh84",
    "deleted": false,
    "street1": null,
    "street2": null,
    "city": "Bangkok",
    "state": null,
    "phone_number": null,
    "postal_code": "10320",
    "country": "gb",
    "financing": "credit",
    "bank": "SAMPLE BANK",
    "brand": "Visa",
    "fingerprint": "QBJ1ZXhEZf6sXO7YJ7ESAHzjynCFEE2rmrNlKXAgT1I=",
    "first_digits": null,
    "last_digits": "4242",
    "name": "JOHN DOE",
    "expiration_month": 12,
    "expiration_year": 2022,
    "security_code_check": true,
    "created_at": "2020-12-19T08:08:58Z"
  },
  "source": null,
  "schedule": "schd_test_5nk0ssxsjf0iqdahbyj",
  "customer": "cust_test_5m922s0sv3dxsjzneu1",
  "dispute": {
    "object": "dispute",
    "id": "dspt_test_5nk1hff1s5xr82p0q0w",
    "livemode": false,
    "location": "/disputes/dspt_test_5nk1hff1s5xr82p0q0w",
    "currency": "THB",
    "amount": 10000,
    "funding_amount": 10000,
    "funding_currency": "THB",
    "metadata": {
    },
    "charge": "chrg_test_5nk0ssyef8lsx3lpqv5",
    "documents": {
      "object": "list",
      "data": [
        {
          "object": "document",
          "livemode": false,
          "id": "docu_test_5nk28ic8h40m1z6kkwz",
          "deleted": false,
          "filename": "test.png",
          "location": "/disputes/dspt_test_5nk1hff1s5xr82p0q0w/documents/docu_test_5nk28ic8h40m1z6kkwz",
          "download_uri": null,
          "created_at": "2021-04-18T12:22:32Z"
        }
      ],
      "limit": 20,
      "offset": 0,
      "total": 1,
      "location": "/disputes/dspt_test_5nk1hff1s5xr82p0q0w/documents",
      "order": "chronological",
      "from": "1970-01-01T00:00:00Z",
      "to": "2021-04-18T14:45:18Z"
    },
    "transactions": [
      {
        "object": "transaction",
        "id": "trxn_test_5nk1hffa8o8k5weugg5",
        "livemode": false,
        "currency": "THB",
        "amount": 10000,
        "location": "/transactions/trxn_test_5nk1hffa8o8k5weugg5",
        "direction": "debit",
        "key": "dispute.started.debit",
        "origin": "dspt_test_5nk1hff1s5xr82p0q0w",
        "transferable_at": "2021-04-18T11:05:36Z",
        "created_at": "2021-04-18T11:05:36Z"
      }
    ],
    "admin_message": null,
    "message": null,
    "reason_code": "goods_or_services_not_provided",
    "reason_message": "Services not provided or Merchandise not received",
    "status": "open",
    "closed_at": null,
    "created_at": "2021-04-18T11:05:36Z"
  },
  "transaction": "trxn_test_5nk0sszmi4upf3f4j2a",
  "failure_code": null,
  "failure_message": null,
  "status": "successful",
  "authorize_uri": null,
  "return_uri": null,
  "created_at": "2021-04-18T09:55:39Z",
  "paid_at": "2021-04-18T09:55:39Z",
  "expires_at": "2021-04-25T09:55:39Z",
  "expired_at": null,
  "reversed_at": null,
  "zero_interest_installments": false,
  "branch": null,
  "terminal": null,
  "device": null
}
