src/__tests__/fixtures/charge_schedules.json

{
  "object": "list",
  "data": [
      {
          "object": "schedule",
          "id": "schd_test_5nk0xhvnrwlbo1xu9gv",
          "deleted": false,
          "livemode": false,
          "location": "/schedules/schd_test_5nk0xhvnrwlbo1xu9gv",
          "every": 1,
          "occurrences": {
              "object": "list",
              "data": [],
              "limit": 20,
              "offset": 0,
              "total": 0,
              "location": "/schedules/schd_test_5nk0xhvnrwlbo1xu9gv/occurrences",
              "order": "chronological",
              "from": "1970-01-01T00:00:00Z",
              "to": "2021-04-19T00:38:19Z"
          },
          "on": {
              "days_of_month": [
                  3,
                  9,
                  11,
                  13,
                  26
              ]
          },
          "in_words": "Every 1 month(s) on the 3rd, 9th, 11th, 13th, and 26th",
          "period": "month",
          "status": "running",
          "active": true,
          "charge": {
              "object": "scheduled_charge",
              "id": "rchg_test_5nk0xhvmfaz9u2nl33k",
              "livemode": false,
              "currency": "THB",
              "amount": 300000,
              "default_card": true,
              "card": "card_test_5m922dndm13zd2reh84",
              "customer": "cust_test_5m922s0sv3dxsjzneu1",
              "description": "",
              "metadata": {},
              "created_at": "2021-04-18T10:08:59Z"
          },
          "next_occurrences_on": [
              "2021-04-26",
              "2021-05-03",
              "2021-05-09",
              "2021-05-11",
              "2021-05-13",
              "2021-05-26",
              "2021-06-03",
              "2021-06-09",
              "2021-06-11",
              "2021-06-13",
              "2021-06-26",
              "2021-07-03",
              "2021-07-09",
              "2021-07-11",
              "2021-07-13",
              "2021-07-26",
              "2021-08-03",
              "2021-08-09",
              "2021-08-11",
              "2021-08-13",
              "2021-08-26",
              "2021-09-03",
              "2021-09-09",
              "2021-09-11",
              "2021-09-13",
              "2021-09-26",
              "2021-10-03",
              "2021-10-09",
              "2021-10-11",
              "2021-10-13"
          ],
          "ended_at": null,
          "start_on": "2021-04-18",
          "end_on": "2022-04-18",
          "created_at": "2021-04-18T10:08:59Z"
      },
      {
          "object": "schedule",
          "id": "schd_test_5nk0wfs0siyk3so9bra",
          "deleted": true,
          "livemode": false,
          "location": "/schedules/schd_test_5nk0wfs0siyk3so9bra",
          "every": 1,
          "occurrences": {
              "object": "list",
              "data": [],
              "limit": 20,
              "offset": 0,
              "total": 0,
              "location": "/schedules/schd_test_5nk0wfs0siyk3so9bra/occurrences",
              "order": "chronological",
              "from": "1970-01-01T00:00:00Z",
              "to": "2021-04-19T00:38:19Z"
          },
          "on": {
              "weekdays": [
                  "tuesday",
                  "thursday",
                  "saturday"
              ]
          },
          "in_words": "Every 1 week(s) on Tuesday, Thursday, and Saturday",
          "period": "week",
          "status": "deleted",
          "active": false,
          "charge": {
              "object": "scheduled_charge",
              "id": "rchg_test_5nk0wfs091z6viy0iww",
              "livemode": false,
              "currency": "THB",
              "amount": 20000,
              "default_card": true,
              "card": "card_test_5m922dndm13zd2reh84",
              "customer": "cust_test_5m922s0sv3dxsjzneu1",
              "description": "",
              "metadata": {},
              "created_at": "2021-04-18T10:05:58Z"
          },
          "next_occurrences_on": [],
          "ended_at": "2021-04-18T10:08:32Z",
          "start_on": "2021-04-18",
          "end_on": "2022-04-18",
          "created_at": "2021-04-18T10:05:58Z"
      },
      {
          "object": "schedule",
          "id": "schd_test_5nk0voyvgt3bffxikho",
          "deleted": true,
          "livemode": false,
          "location": "/schedules/schd_test_5nk0voyvgt3bffxikho",
          "every": 1,
          "occurrences": {
              "object": "list",
              "data": [],
              "limit": 20,
              "offset": 0,
              "total": 0,
              "location": "/schedules/schd_test_5nk0voyvgt3bffxikho/occurrences",
              "order": "chronological",
              "from": "1970-01-01T00:00:00Z",
              "to": "2021-04-19T00:38:19Z"
          },
          "on": {
              "weekday_of_month": "1st_wednesday"
          },
          "in_words": "Every 1 month(s) on the 1st Wednesday",
          "period": "month",
          "status": "deleted",
          "active": false,
          "charge": {
              "object": "scheduled_charge",
              "id": "rchg_test_5nk0voyuci4ux8uiyth",
              "livemode": false,
              "currency": "THB",
              "amount": 20000,
              "default_card": true,
              "card": "card_test_5m922dndm13zd2reh84",
              "customer": "cust_test_5m922s0sv3dxsjzneu1",
              "description": "",
              "metadata": {},
              "created_at": "2021-04-18T10:03:51Z"
          },
          "next_occurrences_on": [],
          "ended_at": "2021-04-18T10:05:33Z",
          "start_on": "2021-04-18",
          "end_on": "2022-04-19",
          "created_at": "2021-04-18T10:03:51Z"
      },
      {
          "object": "schedule",
          "id": "schd_test_5nk0ssxsjf0iqdahbyj",
          "deleted": true,
          "livemode": false,
          "location": "/schedules/schd_test_5nk0ssxsjf0iqdahbyj",
          "every": 1,
          "occurrences": {
              "object": "list",
              "data": [
                  {
                      "object": "occurrence",
                      "livemode": false,
                      "location": "/occurrences/occu_test_5nk0ssxt1dd079ts6pn",
                      "id": "occu_test_5nk0ssxt1dd079ts6pn",
                      "result": "chrg_test_5nk0ssyef8lsx3lpqv5",
                      "schedule": "schd_test_5nk0ssxsjf0iqdahbyj",
                      "message": null,
                      "status": "successful",
                      "processed_at": "2021-04-18T09:55:39Z",
                      "created_at": "2021-04-18T09:55:39Z",
                      "scheduled_on": "2021-04-18",
                      "retry_on": null
                  }
              ],
              "limit": 20,
              "offset": 0,
              "total": 1,
              "location": "/schedules/schd_test_5nk0ssxsjf0iqdahbyj/occurrences",
              "order": "chronological",
              "from": "1970-01-01T00:00:00Z",
              "to": "2021-04-19T00:38:19Z"
          },
          "on": {},
          "in_words": "Every 1 day(s)",
          "period": "day",
          "status": "deleted",
          "active": false,
          "charge": {
              "object": "scheduled_charge",
              "id": "rchg_test_5nk0ssxrq0gbrdf67j7",
              "livemode": false,
              "currency": "THB",
              "amount": 10000,
              "default_card": true,
              "card": "card_test_5m922dndm13zd2reh84",
              "customer": "cust_test_5m922s0sv3dxsjzneu1",
              "description": "",
              "metadata": {},
              "created_at": "2021-04-18T09:55:39Z"
          },
          "next_occurrences_on": [],
          "ended_at": "2021-04-18T10:03:15Z",
          "start_on": "2021-04-18",
          "end_on": "2022-04-18",
          "created_at": "2021-04-18T09:55:39Z"
      }
  ],
  "limit": 20,
  "offset": 0,
  "total": 4,
  "location": "/charges/schedules",
  "order": "reverse_chronological",
  "from": "1970-01-01T00:00:00Z",
  "to": "2021-04-19T00:38:19Z"
}